MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_unicommuart.h
/* UNICOMMUART_CPU_INT_ISET Bits */
/* UNICOMMUART_CPU_INT_ISET[FRMERR] Bits */
#define UNICOMMUART_CPU_INT_ISET_FRMERR_OFS      (1)                             /* !< FRMERR Offset */
#define UNICOMMUART_CPU_INT_ISET_FRMERR_MASK     ((uint32_t)0x00000002U)         /* !< Set UART Framing Error Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_FRMERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_FRMERR_SET      ((uint32_t)0x00000002U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[PARERR] Bits */
#define UNICOMMUART_CPU_INT_ISET_PARERR_OFS      (2)                             /* !< PARERR Offset */
#define UNICOMMUART_CPU_INT_ISET_PARERR_MASK     ((uint32_t)0x00000004U)         /* !< Set UART Parity Error Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_PARERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_PARERR_SET      ((uint32_t)0x00000004U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[BRKERR] Bits */
#define UNICOMMUART_CPU_INT_ISET_BRKERR_OFS      (3)                             /* !< BRKERR Offset */
#define UNICOMMUART_CPU_INT_ISET_BRKERR_MASK     ((uint32_t)0x00000008U)         /* !< Set UART Break Error Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_BRKERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_BRKERR_SET      ((uint32_t)0x00000008U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[OVRERR] Bits */
#define UNICOMMUART_CPU_INT_ISET_OVRERR_OFS      (4)                             /* !< OVRERR Offset */
#define UNICOMMUART_CPU_INT_ISET_OVRERR_MASK     ((uint32_t)0x00000010U)         /* !< Set  UART Receive Overrun Error
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_OVRERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_OVRERR_SET      ((uint32_t)0x00000010U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[RXNE] Bits */
#define UNICOMMUART_CPU_INT_ISET_RXNE_OFS        (5)                             /* !< RXNE Offset */
#define UNICOMMUART_CPU_INT_ISET_RXNE_MASK       ((uint32_t)0x00000020U)         /* !< Set Negative Edge on UARTxRXD
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_RXNE_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_RXNE_SET        ((uint32_t)0x00000020U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[RXPE] Bits */
#define UNICOMMUART_CPU_INT_ISET_RXPE_OFS        (6)                             /* !< RXPE Offset */
#define UNICOMMUART_CPU_INT_ISET_RXPE_MASK       ((uint32_t)0x00000040U)         /* !< Set Positive Edge on UARTxRXD
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_RXPE_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_RXPE_SET        ((uint32_t)0x00000040U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[LINC0] Bits */
#define UNICOMMUART_CPU_INT_ISET_LINC0_OFS       (7)                             /* !< LINC0 Offset */
#define UNICOMMUART_CPU_INT_ISET_LINC0_MASK      ((uint32_t)0x00000080U)         /* !< Set LIN Capture 0 / Match Interrupt
                                                                                    . */
#define UNICOMMUART_CPU_INT_ISET_LINC0_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_LINC0_SET       ((uint32_t)0x00000080U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[LINC1] Bits */
#define UNICOMMUART_CPU_INT_ISET_LINC1_OFS       (8)                             /* !< LINC1 Offset */
#define UNICOMMUART_CPU_INT_ISET_LINC1_MASK      ((uint32_t)0x00000100U)         /* !< Set LIN Capture 1 Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_LINC1_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_LINC1_SET       ((uint32_t)0x00000100U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[LINOVF] Bits */
#define UNICOMMUART_CPU_INT_ISET_LINOVF_OFS      (9)                             /* !< LINOVF Offset */
#define UNICOMMUART_CPU_INT_ISET_LINOVF_MASK     ((uint32_t)0x00000200U)         /* !< Set LIN Hardware Counter Overflow
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_LINOVF_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_LINOVF_SET      ((uint32_t)0x00000200U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[RXINT] Bits */
#define UNICOMMUART_CPU_INT_ISET_RXINT_OFS       (10)                            /* !< RXINT Offset */
#define UNICOMMUART_CPU_INT_ISET_RXINT_MASK      ((uint32_t)0x00000400U)         /* !< Set UART Receive Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_RXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_RXINT_SET       ((uint32_t)0x00000400U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[TXINT] Bits */
#define UNICOMMUART_CPU_INT_ISET_TXINT_OFS       (11)                            /* !< TXINT Offset */
#define UNICOMMUART_CPU_INT_ISET_TXINT_MASK      ((uint32_t)0x00000800U)         /* !< Set UART Transmit Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_TXINT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_TXINT_SET       ((uint32_t)0x00000800U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[EOT] Bits */
#define UNICOMMUART_CPU_INT_ISET_EOT_OFS         (12)                            /* !< EOT Offset */
#define UNICOMMUART_CPU_INT_ISET_EOT_MASK        ((uint32_t)0x00001000U)         /* !< Set UART End of Transmission
                                                                                    Interrupt Indicates that the last bit
                                                                                    of all transmitted data and flags has
                                                                                    left the serializer and without any
                                                                                    further Data in the TX Fifo or
                                                                                    Buffer. */
#define UNICOMMUART_CPU_INT_ISET_EOT_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_EOT_SET         ((uint32_t)0x00001000U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[ADDR_MATCH] Bits */
#define UNICOMMUART_CPU_INT_ISET_ADDR_MATCH_OFS  (13)                            /* !< ADDR_MATCH Offset */
#define UNICOMMUART_CPU_INT_ISET_ADDR_MATCH_MASK ((uint32_t)0x00002000U)         /* !< Set Address Match Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_ADDR_MATCH_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_ADDR_MATCH_SET  ((uint32_t)0x00002000U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[CTS] Bits */
#define UNICOMMUART_CPU_INT_ISET_CTS_OFS         (14)                            /* !< CTS Offset */
#define UNICOMMUART_CPU_INT_ISET_CTS_MASK        ((uint32_t)0x00004000U)         /* !< Set UART Clear to Send Modem
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_CTS_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_CTS_SET         ((uint32_t)0x00004000U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[DMA_DONE_RX] Bits */
#define UNICOMMUART_CPU_INT_ISET_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMUART_CPU_INT_ISET_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< Set DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMUART_CPU_INT_ISET_DMA_DONE_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_CPU_INT_ISET_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[DMA_DONE_TX] Bits */
#define UNICOMMUART_CPU_INT_ISET_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMUART_CPU_INT_ISET_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< Set DMA Done on TX Event Channel
                                                                                    Interrupt */
#define UNICOMMUART_CPU_INT_ISET_DMA_DONE_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_CPU_INT_ISET_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[RTOUT] Bits */
#define UNICOMMUART_CPU_INT_ISET_RTOUT_OFS       (0)                             /* !< RTOUT Offset */
#define UNICOMMUART_CPU_INT_ISET_RTOUT_MASK      ((uint32_t)0x00000001U)         /* !< Set UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_RTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_RTOUT_SET       ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[NERR] Bits */
#define UNICOMMUART_CPU_INT_ISET_NERR_OFS        (17)                            /* !< NERR Offset */
#define UNICOMMUART_CPU_INT_ISET_NERR_MASK       ((uint32_t)0x00020000U)         /* !< Noise Error on triple voting.
                                                                                    Asserted when the 3 samples of
                                                                                    majority voting are not equal */
#define UNICOMMUART_CPU_INT_ISET_NERR_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing this has no effect */
#define UNICOMMUART_CPU_INT_ISET_NERR_SET        ((uint32_t)0x00020000U)         /* !< Set the interrupt */
/* UNICOMMUART_CPU_INT_ISET[DMA_PREIRQ_RX] Bits */
#define UNICOMMUART_CPU_INT_ISET_DMA_PREIRQ_RX_OFS (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMUART_CPU_INT_ISET_DMA_PREIRQ_RX_MASK ((uint32_t)0x00040000U)         /* !< Set DMA PREIRQ Done on RX Event
                                                                                    Channel Interrupt */
#define UNICOMMUART_CPU_INT_ISET_DMA_PREIRQ_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_CPU_INT_ISET_DMA_PREIRQ_RX_SET ((uint32_t)0x00040000U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[DMA_PREIRQ_TX] Bits */
#define UNICOMMUART_CPU_INT_ISET_DMA_PREIRQ_TX_OFS (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMUART_CPU_INT_ISET_DMA_PREIRQ_TX_MASK ((uint32_t)0x00080000U)         /* !< Set DMA PREIRQ Done on TX Event
                                                                                    Channel Interrupt */
#define UNICOMMUART_CPU_INT_ISET_DMA_PREIRQ_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_CPU_INT_ISET_DMA_PREIRQ_TX_SET ((uint32_t)0x00080000U)         /* !< Set Interrupt */
/* UNICOMMUART_CPU_INT_ISET[LTOUT] Bits */
#define UNICOMMUART_CPU_INT_ISET_LTOUT_OFS       (20)                            /* !< LTOUT Offset */
#define UNICOMMUART_CPU_INT_ISET_LTOUT_MASK      ((uint32_t)0x00100000U)         /* !< Set UARTOUT Line Time-Out
                                                                                    Interrupt. */
#define UNICOMMUART_CPU_INT_ISET_LTOUT_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_CPU_INT_ISET_LTOUT_SET       ((uint32_t)0x00100000U)         /* !< Set Interrupt */

