MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_unicommuart.h
/* UNICOMMUART_ICLR Bits */
/* UNICOMMUART_ICLR[FRMERR] Bits */
#define UNICOMMUART_ICLR_FRMERR_OFS              (1)                             /* !< FRMERR Offset */
#define UNICOMMUART_ICLR_FRMERR_MASK             ((uint32_t)0x00000002U)         /* !< Clear UART Framing Error Interrupt. */
#define UNICOMMUART_ICLR_FRMERR_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_FRMERR_CLR              ((uint32_t)0x00000002U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[PARERR] Bits */
#define UNICOMMUART_ICLR_PARERR_OFS              (2)                             /* !< PARERR Offset */
#define UNICOMMUART_ICLR_PARERR_MASK             ((uint32_t)0x00000004U)         /* !< Clear UART Parity Error Interrupt. */
#define UNICOMMUART_ICLR_PARERR_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_PARERR_CLR              ((uint32_t)0x00000004U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[BRKERR] Bits */
#define UNICOMMUART_ICLR_BRKERR_OFS              (3)                             /* !< BRKERR Offset */
#define UNICOMMUART_ICLR_BRKERR_MASK             ((uint32_t)0x00000008U)         /* !< Clear UART Break Error Interrupt. */
#define UNICOMMUART_ICLR_BRKERR_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_BRKERR_CLR              ((uint32_t)0x00000008U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[OVRERR] Bits */
#define UNICOMMUART_ICLR_OVRERR_OFS              (4)                             /* !< OVRERR Offset */
#define UNICOMMUART_ICLR_OVRERR_MASK             ((uint32_t)0x00000010U)         /* !< Clear UART Receive Overrun Error
                                                                                    Interrupt. */
#define UNICOMMUART_ICLR_OVRERR_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_OVRERR_CLR              ((uint32_t)0x00000010U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[RXNE] Bits */
#define UNICOMMUART_ICLR_RXNE_OFS                (5)                             /* !< RXNE Offset */
#define UNICOMMUART_ICLR_RXNE_MASK               ((uint32_t)0x00000020U)         /* !< Clear Negative Edge on UARTxRXD
                                                                                    Interrupt. */
#define UNICOMMUART_ICLR_RXNE_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_RXNE_CLR                ((uint32_t)0x00000020U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[RXPE] Bits */
#define UNICOMMUART_ICLR_RXPE_OFS                (6)                             /* !< RXPE Offset */
#define UNICOMMUART_ICLR_RXPE_MASK               ((uint32_t)0x00000040U)         /* !< Clear Positive Edge on UARTxRXD
                                                                                    Interrupt. */
#define UNICOMMUART_ICLR_RXPE_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_RXPE_CLR                ((uint32_t)0x00000040U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[LINC0] Bits */
#define UNICOMMUART_ICLR_LINC0_OFS               (7)                             /* !< LINC0 Offset */
#define UNICOMMUART_ICLR_LINC0_MASK              ((uint32_t)0x00000080U)         /* !< Clear LIN Capture 0 / Match
                                                                                    Interrupt . */
#define UNICOMMUART_ICLR_LINC0_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_LINC0_CLR               ((uint32_t)0x00000080U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[LINC1] Bits */
#define UNICOMMUART_ICLR_LINC1_OFS               (8)                             /* !< LINC1 Offset */
#define UNICOMMUART_ICLR_LINC1_MASK              ((uint32_t)0x00000100U)         /* !< Clear LIN Capture 1 Interrupt. */
#define UNICOMMUART_ICLR_LINC1_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_LINC1_CLR               ((uint32_t)0x00000100U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[LINOVF] Bits */
#define UNICOMMUART_ICLR_LINOVF_OFS              (9)                             /* !< LINOVF Offset */
#define UNICOMMUART_ICLR_LINOVF_MASK             ((uint32_t)0x00000200U)         /* !< Clear LIN Hardware Counter Overflow
                                                                                    Interrupt. */
#define UNICOMMUART_ICLR_LINOVF_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_LINOVF_CLR              ((uint32_t)0x00000200U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[RXINT] Bits */
#define UNICOMMUART_ICLR_RXINT_OFS               (10)                            /* !< RXINT Offset */
#define UNICOMMUART_ICLR_RXINT_MASK              ((uint32_t)0x00000400U)         /* !< Clear UART Receive Interrupt. */
#define UNICOMMUART_ICLR_RXINT_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_RXINT_CLR               ((uint32_t)0x00000400U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[TXINT] Bits */
#define UNICOMMUART_ICLR_TXINT_OFS               (11)                            /* !< TXINT Offset */
#define UNICOMMUART_ICLR_TXINT_MASK              ((uint32_t)0x00000800U)         /* !< Clear UART Transmit Interrupt. */
#define UNICOMMUART_ICLR_TXINT_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_TXINT_CLR               ((uint32_t)0x00000800U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[EOT] Bits */
#define UNICOMMUART_ICLR_EOT_OFS                 (12)                            /* !< EOT Offset */
#define UNICOMMUART_ICLR_EOT_MASK                ((uint32_t)0x00001000U)         /* !< Clear UART End of Transmission
                                                                                    Interrupt Indicates that the last bit
                                                                                    of all transmitted data and flags has
                                                                                    left the serializer and without any
                                                                                    further Data in the TX Fifo or
                                                                                    Buffer. */
#define UNICOMMUART_ICLR_EOT_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_EOT_CLR                 ((uint32_t)0x00001000U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[ADDR_MATCH] Bits */
#define UNICOMMUART_ICLR_ADDR_MATCH_OFS          (13)                            /* !< ADDR_MATCH Offset */
#define UNICOMMUART_ICLR_ADDR_MATCH_MASK         ((uint32_t)0x00002000U)         /* !< Clear Address Match Interrupt. */
#define UNICOMMUART_ICLR_ADDR_MATCH_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_ADDR_MATCH_CLR          ((uint32_t)0x00002000U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[CTS] Bits */
#define UNICOMMUART_ICLR_CTS_OFS                 (14)                            /* !< CTS Offset */
#define UNICOMMUART_ICLR_CTS_MASK                ((uint32_t)0x00004000U)         /* !< Clear UART Clear to Send Modem
                                                                                    Interrupt. */
#define UNICOMMUART_ICLR_CTS_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_CTS_CLR                 ((uint32_t)0x00004000U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[DMA_DONE_RX] Bits */
#define UNICOMMUART_ICLR_DMA_DONE_RX_OFS         (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMUART_ICLR_DMA_DONE_RX_MASK        ((uint32_t)0x00008000U)         /* !< Clear DMA Done on RX Event Channel
                                                                                    Interrupt */
#define UNICOMMUART_ICLR_DMA_DONE_RX_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_ICLR_DMA_DONE_RX_CLR         ((uint32_t)0x00008000U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[DMA_DONE_TX] Bits */
#define UNICOMMUART_ICLR_DMA_DONE_TX_OFS         (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMUART_ICLR_DMA_DONE_TX_MASK        ((uint32_t)0x00010000U)         /* !< Clear DMA Done on TX Event Channel
                                                                                    Interrupt */
#define UNICOMMUART_ICLR_DMA_DONE_TX_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_ICLR_DMA_DONE_TX_CLR         ((uint32_t)0x00010000U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[RTOUT] Bits */
#define UNICOMMUART_ICLR_RTOUT_OFS               (0)                             /* !< RTOUT Offset */
#define UNICOMMUART_ICLR_RTOUT_MASK              ((uint32_t)0x00000001U)         /* !< Clear UARTOUT Receive Time-Out
                                                                                    Interrupt. */
#define UNICOMMUART_ICLR_RTOUT_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_RTOUT_CLR               ((uint32_t)0x00000001U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[NERR] Bits */
#define UNICOMMUART_ICLR_NERR_OFS                (17)                            /* !< NERR Offset */
#define UNICOMMUART_ICLR_NERR_MASK               ((uint32_t)0x00020000U)         /* !< Noise Error on triple voting.
                                                                                    Asserted when the 3 samples of
                                                                                    majority voting are not equal */
#define UNICOMMUART_ICLR_NERR_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_NERR_CLR                ((uint32_t)0x00020000U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[DMA_PREIRQ_RX] Bits */
#define UNICOMMUART_ICLR_DMA_PREIRQ_RX_OFS       (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMUART_ICLR_DMA_PREIRQ_RX_MASK      ((uint32_t)0x00040000U)         /* !< Clear DMA PREIRQ Done on RX Event
                                                                                    Channel Interrupt */
#define UNICOMMUART_ICLR_DMA_PREIRQ_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_ICLR_DMA_PREIRQ_RX_CLR       ((uint32_t)0x00040000U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[DMA_PREIRQ_TX] Bits */
#define UNICOMMUART_ICLR_DMA_PREIRQ_TX_OFS       (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMUART_ICLR_DMA_PREIRQ_TX_MASK      ((uint32_t)0x00080000U)         /* !< Clear DMA PREIRQ Done on TX Event
                                                                                    Channel Interrupt */
#define UNICOMMUART_ICLR_DMA_PREIRQ_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMUART_ICLR_DMA_PREIRQ_TX_CLR       ((uint32_t)0x00080000U)         /* !< Clear Interrupt */
/* UNICOMMUART_ICLR[LTOUT] Bits */
#define UNICOMMUART_ICLR_LTOUT_OFS               (20)                            /* !< LTOUT Offset */
#define UNICOMMUART_ICLR_LTOUT_MASK              ((uint32_t)0x00100000U)         /* !< Clear UARTOUT Line Time-Out
                                                                                    Interrupt. */
#define UNICOMMUART_ICLR_LTOUT_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMUART_ICLR_LTOUT_CLR               ((uint32_t)0x00100000U)         /* !< Clear Interrupt */

/* UNICOMMUART_CLKDIV Bits */
/* UNICOMMUART_CLKDIV[RATIO] Bits */
#define UNICOMMUART_CLKDIV_RATIO_OFS             (0)                             /* !< RATIO Offset */
#define UNICOMMUART_CLKDIV_RATIO_MASK            ((uint32_t)0x0000003FU)         /* !< Selects divide ratio of module
                                                                                    clock  Division factor  0 : DIV_BY_1
                                                                                    1 : DIV_BY_2 .... 63: DIV_BY_64 */
#define UNICOMMUART_CLKDIV_RATIO_DIV_BY_1        ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define UNICOMMUART_CLKDIV_RATIO_DIV_BY_2        ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define UNICOMMUART_CLKDIV_RATIO_DIV_BY_3        ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define UNICOMMUART_CLKDIV_RATIO_DIV_BY_4        ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define UNICOMMUART_CLKDIV_RATIO_DIV_BY_5        ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define UNICOMMUART_CLKDIV_RATIO_DIV_BY_6        ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define UNICOMMUART_CLKDIV_RATIO_DIV_BY_7        ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define UNICOMMUART_CLKDIV_RATIO_DIV_BY_8        ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */
#define UNICOMMUART_CLKDIV_RATIO_DIV_BY_61       ((uint32_t)0x0000003CU)         /* !< Divide clock source by 8 */
#define UNICOMMUART_CLKDIV_RATIO_DIV_BY_62       ((uint32_t)0x0000003DU)         /* !< Divide clock source by 8 */
#define UNICOMMUART_CLKDIV_RATIO_DIV_BY_63       ((uint32_t)0x0000003EU)         /* !< Divide clock source by 8 */
#define UNICOMMUART_CLKDIV_RATIO_DIV_BY_64       ((uint32_t)0x0000003FU)         /* !< Divide clock source by 8 */

/* UNICOMMUART_CLKSEL Bits */
/* UNICOMMUART_CLKSEL[MFCLK_SEL] Bits */
#define UNICOMMUART_CLKSEL_MFCLK_SEL_OFS         (2)                             /* !< MFCLK_SEL Offset */
#define UNICOMMUART_CLKSEL_MFCLK_SEL_MASK        ((uint32_t)0x00000004U)         /* !< Selects MFCLK as clock source if
                                                                                    enabled */
#define UNICOMMUART_CLKSEL_MFCLK_SEL_DISABLE     ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMUART_CLKSEL_MFCLK_SEL_ENABLE      ((uint32_t)0x00000004U)         /* !< Select this clock as a source */
/* UNICOMMUART_CLKSEL[BUSCLK_SEL] Bits */
#define UNICOMMUART_CLKSEL_BUSCLK_SEL_OFS        (3)                             /* !< BUSCLK_SEL Offset */
#define UNICOMMUART_CLKSEL_BUSCLK_SEL_MASK       ((uint32_t)0x00000008U)         /* !< Selects BUS CLK as clock source if
                                                                                    enabled */
#define UNICOMMUART_CLKSEL_BUSCLK_SEL_DISABLE    ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMUART_CLKSEL_BUSCLK_SEL_ENABLE     ((uint32_t)0x00000008U)         /* !< Select this clock as a source */
/* UNICOMMUART_CLKSEL[LFCLK_SEL] Bits */
#define UNICOMMUART_CLKSEL_LFCLK_SEL_OFS         (1)                             /* !< LFCLK_SEL Offset */
#define UNICOMMUART_CLKSEL_LFCLK_SEL_MASK        ((uint32_t)0x00000002U)         /* !< Selects LFCLK as clock source if
                                                                                    enabled */
#define UNICOMMUART_CLKSEL_LFCLK_SEL_DISABLE     ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMUART_CLKSEL_LFCLK_SEL_ENABLE      ((uint32_t)0x00000002U)         /* !< Select this clock as a source */
/* UNICOMMUART_CLKSEL[ASYNC_LFCLK_SEL] Bits */
#define UNICOMMUART_CLKSEL_ASYNC_LFCLK_SEL_OFS   (8)                             /* !< ASYNC_LFCLK_SEL Offset */
#define UNICOMMUART_CLKSEL_ASYNC_LFCLK_SEL_MASK  ((uint32_t)0x00000100U)         /* !< Asynchronous lfclk selected as
                                                                                    source */
#define UNICOMMUART_CLKSEL_ASYNC_LFCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMUART_CLKSEL_ASYNC_LFCLK_SEL_ENABLE ((uint32_t)0x00000100U)         /* !< Select this clock as a source */
/* UNICOMMUART_CLKSEL[ASYNC_SYSCLK_SEL] Bits */
#define UNICOMMUART_CLKSEL_ASYNC_SYSCLK_SEL_OFS  (9)                             /* !< ASYNC_SYSCLK_SEL Offset */
#define UNICOMMUART_CLKSEL_ASYNC_SYSCLK_SEL_MASK ((uint32_t)0x00000200U)         /* !< Asynchronous sysclk selected as
                                                                                    source */
#define UNICOMMUART_CLKSEL_ASYNC_SYSCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMUART_CLKSEL_ASYNC_SYSCLK_SEL_ENABLE ((uint32_t)0x00000200U)         /* !< Select this clock as a source */
/* UNICOMMUART_CLKSEL[ASYNC_HFCLK_SEL] Bits */
#define UNICOMMUART_CLKSEL_ASYNC_HFCLK_SEL_OFS   (10)                            /* !< ASYNC_HFCLK_SEL Offset */
#define UNICOMMUART_CLKSEL_ASYNC_HFCLK_SEL_MASK  ((uint32_t)0x00000400U)         /* !< Asynchronous HFCLK selected as
                                                                                    source */
#define UNICOMMUART_CLKSEL_ASYNC_HFCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMUART_CLKSEL_ASYNC_HFCLK_SEL_ENABLE ((uint32_t)0x00000400U)         /* !< Select this clock as a source */
/* UNICOMMUART_CLKSEL[ASYNC_PLL_SEL] Bits */
#define UNICOMMUART_CLKSEL_ASYNC_PLL_SEL_OFS     (11)                            /* !< ASYNC_PLL_SEL Offset */
#define UNICOMMUART_CLKSEL_ASYNC_PLL_SEL_MASK    ((uint32_t)0x00000800U)         /* !< Asynchronous PLL selected as source */
#define UNICOMMUART_CLKSEL_ASYNC_PLL_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMUART_CLKSEL_ASYNC_PLL_SEL_ENABLE  ((uint32_t)0x00000800U)         /* !< Select this clock as a source */

